Documents/СертификацияНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>СертификацияНоменклатуры</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСертификата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСертификата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище_1</Name>
					<Comment>Хранилище</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище_2</Name>
					<Comment>Хранилище</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище_3</Name>
					<Comment>Хранилище</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище_4</Name>
					<Comment>Хранилище</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище_5</Name>
					<Comment>Хранилище</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище_6</Name>
					<Comment>Хранилище</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище_7</Name>
					<Comment>Хранилище</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище_8</Name>
					<Comment>Хранилище</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище_9</Name>
					<Comment>Хранилище</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище_10</Name>
					<Comment>Хранилище</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контракт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураПродаж</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ХранилищеДополнительнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ХранилищеДополнительнойИнформации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстФайла</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/СертификацияНоменклатуры/Ext/ObjectModule.bsl
Перем мОснИзображение Экспорт;
Перем ДопИзображение1 Экспорт; 
Перем ДопИзображение2 Экспорт; 
Перем ДопИзображение3 Экспорт; 
Перем ДопИзображение4 Экспорт;
Перем ДопИзображение5 Экспорт;
Перем ДопИзображение6 Экспорт;
Перем ДопИзображение7 Экспорт;
Перем ДопИзображение8 Экспорт;
Перем ДопИзображение9 Экспорт;

Перем УДАЛ_мОснИзображение Экспорт;
Перем УДАЛ_ДопИзображение1 Экспорт; 
Перем УДАЛ_ДопИзображение2 Экспорт; 
Перем УДАЛ_ДопИзображение3 Экспорт; 
Перем УДАЛ_ДопИзображение4 Экспорт;
Перем УДАЛ_ДопИзображение5 Экспорт;
Перем УДАЛ_ДопИзображение6 Экспорт;
Перем УДАЛ_ДопИзображение7 Экспорт;
Перем УДАЛ_ДопИзображение8 Экспорт;
Перем УДАЛ_ДопИзображение9 Экспорт;


Процедура ЗаписьСертификатаНоменклатуры()
	
	мОснИзображение = ?(мОснИзображение = Неопределено,Ложь,мОснИзображение);
	ДопИзображение1 = ?(ДопИзображение1 = Неопределено,Ложь,ДопИзображение1);
	ДопИзображение2 = ?(ДопИзображение2 = Неопределено,Ложь,ДопИзображение2);
	ДопИзображение3 = ?(ДопИзображение3 = Неопределено,Ложь,ДопИзображение3);
	ДопИзображение4 = ?(ДопИзображение4 = Неопределено,Ложь,ДопИзображение4);
	ДопИзображение5 = ?(ДопИзображение5 = Неопределено,Ложь,ДопИзображение5);
	ДопИзображение6 = ?(ДопИзображение6 = Неопределено,Ложь,ДопИзображение6);
	ДопИзображение7 = ?(ДопИзображение7 = Неопределено,Ложь,ДопИзображение7);
	ДопИзображение8 = ?(ДопИзображение8 = Неопределено,Ложь,ДопИзображение8);
	ДопИзображение9 = ?(ДопИзображение9 = Неопределено,Ложь,ДопИзображение9);
	
	УДАЛ_мОснИзображение = ?(УДАЛ_мОснИзображение = Неопределено,Ложь,УДАЛ_мОснИзображение);
	УДАЛ_ДопИзображение1 = ?(УДАЛ_ДопИзображение1 = Неопределено,Ложь,УДАЛ_ДопИзображение1);
	УДАЛ_ДопИзображение2 = ?(УДАЛ_ДопИзображение2 = Неопределено,Ложь,УДАЛ_ДопИзображение2);
	УДАЛ_ДопИзображение3 = ?(УДАЛ_ДопИзображение3 = Неопределено,Ложь,УДАЛ_ДопИзображение3);
	УДАЛ_ДопИзображение4 = ?(УДАЛ_ДопИзображение4 = Неопределено,Ложь,УДАЛ_ДопИзображение4);
	УДАЛ_ДопИзображение5 = ?(УДАЛ_ДопИзображение5 = Неопределено,Ложь,УДАЛ_ДопИзображение5);
	УДАЛ_ДопИзображение6 = ?(УДАЛ_ДопИзображение6 = Неопределено,Ложь,УДАЛ_ДопИзображение6);
	УДАЛ_ДопИзображение7 = ?(УДАЛ_ДопИзображение7 = Неопределено,Ложь,УДАЛ_ДопИзображение7);
	УДАЛ_ДопИзображение8 = ?(УДАЛ_ДопИзображение8 = Неопределено,Ложь,УДАЛ_ДопИзображение8);
	УДАЛ_ДопИзображение9 = ?(УДАЛ_ДопИзображение9 = Неопределено,Ложь,УДАЛ_ДопИзображение9);
	
	Для каждого Стр Из СписокНоменклатуры Цикл                                           
		ПерезаписьИСозданиеИзображенийСертификатовНоменклатуры(Стр.Номенклатура);
	КонецЦикла; 
	
КонецПроцедуры

Процедура ПерезаписьИСозданиеИзображенийСертификатовНоменклатуры(ТекущаяСерия)
	
	СпрХранилище = Справочники.ХранилищеДополнительнойИнформации;
	Отбор = Новый Структура("Объект",ТекущаяСерия);
	ИзобрСерии = СпрХранилище.Выбрать(,,Отбор);
	Пока ИзобрСерии.Следующий() Цикл 
		//Перебор элементов справочника по отбору
		//Перезапись основной Картинки
		
		Если Найти(ИзобрСерии.Наименование,"Сертификат №") Тогда 
			
			Если УДАЛ_мОснИзображение Тогда
				СпрХранилищеДополнительнойИнформации = ИзобрСерии.ПолучитьОбъект();
				СпрХранилищеДополнительнойИнформации.Удалить();
				УДАЛ_мОснИзображение = Ложь;
			ИначеЕсли мОснИзображение Тогда
				СпрХранилищеДополнительнойИнформации = ИзобрСерии.ПолучитьОбъект();
				СпрХранилищеДополнительнойИнформации.Объект = ТекущаяСерия;
				СпрХранилищеДополнительнойИнформации.Хранилище = Хранилище_1;
				СпрХранилищеДополнительнойИнформации.Наименование = "Сертификат №" + НомерСертификата;
				СпрХранилищеДополнительнойИнформации.ИмяФайла = "Сертификат №" + НомерСертификата + ".jpg"; 
				Попытка
					СпрХранилищеДополнительнойИнформации.Записать();
					мОснИзображение = Ложь;
				Исключение
					Сообщить("Не удалось создать новое изображение для номенклатуры" + " " + ТекущаяСерия);
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
		//ДопИзображение1
		Если Найти(ИзобрСерии.Наименование,"ДопИзображение №1") Тогда
			Если УДАЛ_ДопИзображение1 Тогда
				СпрХранилищеДополнительнойИнформации = ИзобрСерии.ПолучитьОбъект();
				СпрХранилищеДополнительнойИнформации.Удалить();
				УДАЛ_ДопИзображение1 = Ложь;
			ИначеЕсли ДопИзображение1 Тогда
				СпрХранилищеДополнительнойИнформации = ИзобрСерии.ПолучитьОбъект();
				СпрХранилищеДополнительнойИнформации.Объект = ТекущаяСерия;
				СпрХранилищеДополнительнойИнформации.Хранилище = Хранилище_2;
				СпрХранилищеДополнительнойИнформации.Наименование = "ДопИзображение №1 №" + НомерСертификата;
				СпрХранилищеДополнительнойИнформации.ИмяФайла = "ДопИзображение №1 №" + НомерСертификата + ".jpg"; 
				Попытка
					СпрХранилищеДополнительнойИнформации.Записать();
					ДопИзображение1 = Ложь;
				Исключение
					Сообщить("Не удалось создать новое ДопИзображение для номенклатуры" + " " + ТекущаяСерия);
				КонецПопытки;
			КонецЕсли;
			                         	
		КонецЕсли;
		//ДопИзображение2
		Если Найти(ИзобрСерии.Наименование,"ДопИзображение №2") Тогда
			Если УДАЛ_ДопИзображение2 Тогда
				СпрХранилищеДополнительнойИнформации = ИзобрСерии.ПолучитьОбъект();
				СпрХранилищеДополнительнойИнформации.Удалить();
				УДАЛ_ДопИзображение2 = Ложь;
			ИначеЕсли ДопИзображение2 Тогда
				СпрХранилищеДополнительнойИнформации = ИзобрСерии.ПолучитьОбъект();
				СпрХранилищеДополнительнойИнформации.Объект = ТекущаяСерия;
				СпрХранилищеДополнительнойИнформации.Хранилище = Хранилище_3;
				СпрХранилищеДополнительнойИнформации.Наименование = "ДопИзображение №2 №" + НомерСертификата;
				СпрХранилищеДополнительнойИнформации.ИмяФайла = "ДопИзображение №2 №" + НомерСертификата + ".jpg"; 
				Попытка
					СпрХранилищеДополнительнойИнформации.Записать();
					ДопИзображение2 = Ложь;
				Исключение
					Сообщить("Не удалось создать новое ДопИзображение для номенклатуры" + " " + ТекущаяСерия);
				КонецПопытки;
			КонецЕсли;
			                         	
		КонецЕсли;
		
		//ДопИзображение3
		Если Найти(ИзобрСерии.Наименование,"ДопИзображение №3") Тогда
			Если УДАЛ_ДопИзображение3 Тогда
				СпрХранилищеДополнительнойИнформации = ИзобрСерии.ПолучитьОбъект();
				СпрХранилищеДополнительнойИнформации.Удалить();
				УДАЛ_ДопИзображение3 = Ложь;
			ИначеЕсли ДопИзображение3 Тогда
				СпрХранилищеДополнительнойИнформации = ИзобрСерии.ПолучитьОбъект();
				СпрХранилищеДополнительнойИнформации.Объект = ТекущаяСерия;
				СпрХранилищеДополнительнойИнформации.Хранилище = Хранилище_4;
				СпрХранилищеДополнительнойИнформации.Наименование = "ДопИзображение №3 №" + НомерСертификата;
				СпрХранилищеДополнительнойИнформации.ИмяФайла = "ДопИзображение №3 №" + НомерСертификата + ".jpg"; 
				Попытка
					СпрХранилищеДополнительнойИнформации.Записать();
					ДопИзображение3 = Ложь;
				Исключение
					Сообщить("Не удалось создать новое ДопИзображение для номенклатуры" + " " + ТекущаяСерия);
				КонецПопытки;
			КонецЕсли;
			                         	
		КонецЕсли;
		
		//ДопИзображение4
		Если Найти(ИзобрСерии.Наименование,"ДопИзображение №4") Тогда
			Если УДАЛ_ДопИзображение4 Тогда
				СпрХранилищеДополнительнойИнформации = ИзобрСерии.ПолучитьОбъект();
				СпрХранилищеДополнительнойИнформации.Удалить();
				УДАЛ_ДопИзображение4 = Ложь;
			ИначеЕсли ДопИзображение4 Тогда
				СпрХранилищеДополнительнойИнформации = ИзобрСерии.ПолучитьОбъект();
				СпрХранилищеДополнительнойИнформации.Объект = ТекущаяСерия;
				СпрХранилищеДополнительнойИнформации.Хранилище = Хранилище_5;
				СпрХранилищеДополнительнойИнформации.Наименование = "ДопИзображение №4 №" + НомерСертификата;
				СпрХранилищеДополнительнойИнформации.ИмяФайла = "ДопИзображение №4 №" + НомерСертификата + ".jpg"; 
				Попытка
					СпрХранилищеДополнительнойИнформации.Записать();
					ДопИзображение4 = Ложь;
				Исключение
					Сообщить("Не удалось создать новое ДопИзображение для номенклатуры" + " " + ТекущаяСерия);
				КонецПопытки;
			КонецЕсли;
			                         	
		КонецЕсли;
		
		//ДопИзображение5
		Если Найти(ИзобрСерии.Наименование,"ДопИзображение №5") Тогда
			Если УДАЛ_ДопИзображение5 Тогда
				СпрХранилищеДополнительнойИнформации = ИзобрСерии.ПолучитьОбъект();
				СпрХранилищеДополнительнойИнформации.Удалить();
				УДАЛ_ДопИзображение5 = Ложь;
			ИначеЕсли ДопИзображение5 Тогда
				СпрХранилищеДополнительнойИнформации = ИзобрСерии.ПолучитьОбъект();
				СпрХранилищеДополнительнойИнформации.Объект = ТекущаяСерия;
				СпрХранилищеДополнительнойИнформации.Хранилище = Хранилище_6;
				СпрХранилищеДополнительнойИнформации.Наименование = "ДопИзображение №5 №" + НомерСертификата;
				СпрХранилищеДополнительнойИнформации.ИмяФайла = "ДопИзображение №5 №" + НомерСертификата + ".jpg"; 
				Попытка
					СпрХранилищеДополнительнойИнформации.Записать();
					ДопИзображение5 = Ложь;
				Исключение
					Сообщить("Не удалось создать новое ДопИзображение для номенклатуры" + " " + ТекущаяСерия);
				КонецПопытки;
			КонецЕсли;
			                         	
		КонецЕсли;
		
		//ДопИзображение6
		Если Найти(ИзобрСерии.Наименование,"ДопИзображение №6") Тогда
			Если УДАЛ_ДопИзображение6 Тогда
				СпрХранилищеДополнительнойИнформации = ИзобрСерии.ПолучитьОбъект();
				СпрХранилищеДополнительнойИнформации.Удалить();
				УДАЛ_ДопИзображение6 = Ложь;
			ИначеЕсли ДопИзображение6 Тогда
				СпрХранилищеДополнительнойИнформации = ИзобрСерии.ПолучитьОбъект();
				СпрХранилищеДополнительнойИнформации.Объект = ТекущаяСерия;
				СпрХранилищеДополнительнойИнформации.Хранилище = Хранилище_7;
				СпрХранилищеДополнительнойИнформации.Наименование = "ДопИзображение №6 №" + НомерСертификата;
				СпрХранилищеДополнительнойИнформации.ИмяФайла = "ДопИзображение №6 №" + НомерСертификата + ".jpg"; 
				Попытка
					СпрХранилищеДополнительнойИнформации.Записать();
					ДопИзображение6 = Ложь;
				Исключение
					Сообщить("Не удалось создать новое ДопИзображение для номенклатуры" + " " + ТекущаяСерия);
				КонецПопытки;
			КонецЕсли;
			                         	
		КонецЕсли;
		
		//ДопИзображение7
		Если Найти(ИзобрСерии.Наименование,"ДопИзображение №7") Тогда
			Если УДАЛ_ДопИзображение7 Тогда
				СпрХранилищеДополнительнойИнформации = ИзобрСерии.ПолучитьОбъект();
				СпрХранилищеДополнительнойИнформации.Удалить();
				УДАЛ_ДопИзображение7 = Ложь;
			ИначеЕсли ДопИзображение7 Тогда
				СпрХранилищеДополнительнойИнформации = ИзобрСерии.ПолучитьОбъект();
				СпрХранилищеДополнительнойИнформации.Объект = ТекущаяСерия;
				СпрХранилищеДополнительнойИнформации.Хранилище = Хранилище_8;
				СпрХранилищеДополнительнойИнформации.Наименование = "ДопИзображение №7 №" + НомерСертификата;
				СпрХранилищеДополнительнойИнформации.ИмяФайла = "ДопИзображение №7 №" + НомерСертификата + ".jpg"; 
				Попытка
					СпрХранилищеДополнительнойИнформации.Записать();
					ДопИзображение7 = Ложь;
				Исключение
					Сообщить("Не удалось создать новое ДопИзображение для номенклатуры" + " " + ТекущаяСерия);
				КонецПопытки;
			КонецЕсли;
			                         	
		КонецЕсли;
		
		//ДопИзображение8
		Если Найти(ИзобрСерии.Наименование,"ДопИзображение №8") Тогда
			Если УДАЛ_ДопИзображение8 Тогда
				СпрХранилищеДополнительнойИнформации = ИзобрСерии.ПолучитьОбъект();
				СпрХранилищеДополнительнойИнформации.Удалить();
				УДАЛ_ДопИзображение8 = Ложь;
			ИначеЕсли ДопИзображение8 Тогда
				СпрХранилищеДополнительнойИнформации = ИзобрСерии.ПолучитьОбъект();
				СпрХранилищеДополнительнойИнформации.Объект = ТекущаяСерия;
				СпрХранилищеДополнительнойИнформации.Хранилище = Хранилище_9;
				СпрХранилищеДополнительнойИнформации.Наименование = "ДопИзображение №8 №" + НомерСертификата;
				СпрХранилищеДополнительнойИнформации.ИмяФайла = "ДопИзображение №8 №" + НомерСертификата + ".jpg"; 
				Попытка
					СпрХранилищеДополнительнойИнформации.Записать();
					ДопИзображение8 = Ложь;
				Исключение
					Сообщить("Не удалось создать новое ДопИзображение для номенклатуры" + " " + ТекущаяСерия);
				КонецПопытки;
			КонецЕсли;
			                         	
		КонецЕсли;
		
		//ДопИзображение9
		Если Найти(ИзобрСерии.Наименование,"ДопИзображение №9") Тогда
			Если УДАЛ_ДопИзображение9 Тогда
				СпрХранилищеДополнительнойИнформации = ИзобрСерии.ПолучитьОбъект();
				СпрХранилищеДополнительнойИнформации.Удалить();
				УДАЛ_ДопИзображение9 = Ложь;
			ИначеЕсли ДопИзображение9 Тогда
				СпрХранилищеДополнительнойИнформации = ИзобрСерии.ПолучитьОбъект();
				СпрХранилищеДополнительнойИнформации.Объект = ТекущаяСерия;
				СпрХранилищеДополнительнойИнформации.Хранилище = Хранилище_10;
				СпрХранилищеДополнительнойИнформации.Наименование = "ДопИзображение №9 №" + НомерСертификата;
				СпрХранилищеДополнительнойИнформации.ИмяФайла = "ДопИзображение №9 №" + НомерСертификата + ".jpg"; 
				Попытка
					СпрХранилищеДополнительнойИнформации.Записать();
					ДопИзображение9 = Ложь;
				Исключение
					Сообщить("Не удалось создать новое ДопИзображение для номенклатуры" + " " + ТекущаяСерия);
				КонецПопытки;
			КонецЕсли;
			                         	
		КонецЕсли;
		
	КонецЦикла;

	Если мОснИзображение Тогда 
		//Создание картинки
		СпрХранилищеДополнительнойИнформации = СпрХранилище.СоздатьЭлемент();	
		СпрХранилищеДополнительнойИнформации.Объект = ТекущаяСерия;
		СпрХранилищеДополнительнойИнформации.Хранилище = Хранилище_1;
		СпрХранилищеДополнительнойИнформации.Наименование = "Сертификат №" + НомерСертификата;
		СпрХранилищеДополнительнойИнформации.ИмяФайла = "Сертификат №" + НомерСертификата + ".jpg"; 
		
		Попытка
			СпрХранилищеДополнительнойИнформации.Записать();
		Исключение
			Сообщить("Не удалось создать новое изображение для номенклатуры" + " " + ТекущаяСерия);
		КонецПопытки;                         	
	КонецЕсли;
	
	Если ДопИзображение1 Тогда 
		//Создание картинки
		СпрХранилищеДополнительнойИнформации = СпрХранилище.СоздатьЭлемент();	
		СпрХранилищеДополнительнойИнформации.Объект = ТекущаяСерия;
		СпрХранилищеДополнительнойИнформации.Хранилище = Хранилище_2;
		СпрХранилищеДополнительнойИнформации.Наименование = "ДопИзображение №1 №" + НомерСертификата;
		СпрХранилищеДополнительнойИнформации.ИмяФайла = "ДопИзображение №1 №" + НомерСертификата + ".jpg"; 
		
		Попытка
			СпрХранилищеДополнительнойИнформации.Записать();
		Исключение
			Сообщить("Не удалось создать новое изображение для номенклатуры" + " " + ТекущаяСерия);
		КонецПопытки;                         	
	КонецЕсли;
	
	Если ДопИзображение2 Тогда 
		//Создание картинки
		СпрХранилищеДополнительнойИнформации = СпрХранилище.СоздатьЭлемент();	
		СпрХранилищеДополнительнойИнформации.Объект = ТекущаяСерия;
		СпрХранилищеДополнительнойИнформации.Хранилище = Хранилище_3;
		СпрХранилищеДополнительнойИнформации.Наименование = "ДопИзображение №2 №" + НомерСертификата;
		СпрХранилищеДополнительнойИнформации.ИмяФайла = "ДопИзображение №2 №" + НомерСертификата + ".jpg"; 
		
		Попытка
			СпрХранилищеДополнительнойИнформации.Записать();
		Исключение
			Сообщить("Не удалось создать новое изображение для номенклатуры" + " " + ТекущаяСерия);
		КонецПопытки;                         	
	КонецЕсли;
	
	Если ДопИзображение3 Тогда 
		//Создание картинки
		СпрХранилищеДополнительнойИнформации = СпрХранилище.СоздатьЭлемент();	
		СпрХранилищеДополнительнойИнформации.Объект = ТекущаяСерия;
		СпрХранилищеДополнительнойИнформации.Хранилище = Хранилище_4;
		СпрХранилищеДополнительнойИнформации.Наименование = "ДопИзображение №3 №" + НомерСертификата;
		СпрХранилищеДополнительнойИнформации.ИмяФайла = "ДопИзображение №3 №" + НомерСертификата + ".jpg"; 
		
		Попытка
			СпрХранилищеДополнительнойИнформации.Записать();
		Исключение
			Сообщить("Не удалось создать новое изображение для номенклатуры" + " " + ТекущаяСерия);
		КонецПопытки;                         	
	КонецЕсли;
	
	Если ДопИзображение4 Тогда 
		//Создание картинки
		СпрХранилищеДополнительнойИнформации = СпрХранилище.СоздатьЭлемент();	
		СпрХранилищеДополнительнойИнформации.Объект = ТекущаяСерия;
		СпрХранилищеДополнительнойИнформации.Хранилище = Хранилище_5;
		СпрХранилищеДополнительнойИнформации.Наименование = "ДопИзображение №4 №" + НомерСертификата;
		СпрХранилищеДополнительнойИнформации.ИмяФайла = "ДопИзображение №4 №" + НомерСертификата + ".jpg"; 
		
		Попытка
			СпрХранилищеДополнительнойИнформации.Записать();
		Исключение
			Сообщить("Не удалось создать новое изображение для номенклатуры" + " " + ТекущаяСерия);
		КонецПопытки;                         	
	КонецЕсли;
	
	Если ДопИзображение5 Тогда 
		//Создание картинки
		СпрХранилищеДополнительнойИнформации = СпрХранилище.СоздатьЭлемент();	
		СпрХранилищеДополнительнойИнформации.Объект = ТекущаяСерия;
		СпрХранилищеДополнительнойИнформации.Хранилище = Хранилище_6;
		СпрХранилищеДополнительнойИнформации.Наименование = "ДопИзображение №5 №" + НомерСертификата;
		СпрХранилищеДополнительнойИнформации.ИмяФайла = "ДопИзображение №5 №" + НомерСертификата + ".jpg"; 
		
		Попытка
			СпрХранилищеДополнительнойИнформации.Записать();
		Исключение
			Сообщить("Не удалось создать новое изображение для номенклатуры" + " " + ТекущаяСерия);
		КонецПопытки;                         	
	КонецЕсли;
	
	Если ДопИзображение6 Тогда 
		//Создание картинки
		СпрХранилищеДополнительнойИнформации = СпрХранилище.СоздатьЭлемент();	
		СпрХранилищеДополнительнойИнформации.Объект = ТекущаяСерия;
		СпрХранилищеДополнительнойИнформации.Хранилище = Хранилище_7;
		СпрХранилищеДополнительнойИнформации.Наименование = "ДопИзображение №6 №" + НомерСертификата;
		СпрХранилищеДополнительнойИнформации.ИмяФайла = "ДопИзображение №6 №" + НомерСертификата + ".jpg"; 
		
		Попытка
			СпрХранилищеДополнительнойИнформации.Записать();
		Исключение
			Сообщить("Не удалось создать новое изображение для номенклатуры" + " " + ТекущаяСерия);
		КонецПопытки;                         	
	КонецЕсли;
	
	Если ДопИзображение7 Тогда 
		//Создание картинки
		СпрХранилищеДополнительнойИнформации = СпрХранилище.СоздатьЭлемент();	
		СпрХранилищеДополнительнойИнформации.Объект = ТекущаяСерия;
		СпрХранилищеДополнительнойИнформации.Хранилище = Хранилище_8;
		СпрХранилищеДополнительнойИнформации.Наименование = "ДопИзображение №7 №" + НомерСертификата;
		СпрХранилищеДополнительнойИнформации.ИмяФайла = "ДопИзображение №7 №" + НомерСертификата + ".jpg"; 
		
		Попытка
			СпрХранилищеДополнительнойИнформации.Записать();
		Исключение
			Сообщить("Не удалось создать новое изображение для номенклатуры" + " " + ТекущаяСерия);
		КонецПопытки;                         	
	КонецЕсли;
	
	Если ДопИзображение8 Тогда 
		//Создание картинки
		СпрХранилищеДополнительнойИнформации = СпрХранилище.СоздатьЭлемент();	
		СпрХранилищеДополнительнойИнформации.Объект = ТекущаяСерия;
		СпрХранилищеДополнительнойИнформации.Хранилище = Хранилище_9;
		СпрХранилищеДополнительнойИнформации.Наименование = "ДопИзображение №8 №" + НомерСертификата;
		СпрХранилищеДополнительнойИнформации.ИмяФайла = "ДопИзображение №8 №" + НомерСертификата + ".jpg"; 
		
		Попытка
			СпрХранилищеДополнительнойИнформации.Записать();
		Исключение
			Сообщить("Не удалось создать новое изображение для номенклатуры" + " " + ТекущаяСерия);
		КонецПопытки;                         	
	КонецЕсли;
	
	Если ДопИзображение9 Тогда 
		//Создание картинки
		СпрХранилищеДополнительнойИнформации = СпрХранилище.СоздатьЭлемент();	
		СпрХранилищеДополнительнойИнформации.Объект = ТекущаяСерия;
		СпрХранилищеДополнительнойИнформации.Хранилище = Хранилище_10;
		СпрХранилищеДополнительнойИнформации.Наименование = "ДопИзображение №9 №" + НомерСертификата;
		СпрХранилищеДополнительнойИнформации.ИмяФайла = "ДопИзображение №9 №" + НомерСертификата + ".jpg"; 
		
		Попытка
			СпрХранилищеДополнительнойИнформации.Записать();
		Исключение
			Сообщить("Не удалось создать новое изображение для номенклатуры" + " " + ТекущаяСерия);
		КонецПопытки;                         	
	КонецЕсли;



КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ЗаписьСертификатаНоменклатуры();
КонецПроцедуры
